In [5]:
# Prctice Panadas
import pandas as pd
students = [{"Name":"Inam","Age" : 42},{"Name":"Mohsin","Age" : 26}]
df = pd.DataFrame(students)

In [6]:
df.values

array([[42, 'Inam'],
       [26, 'Mohsin']], dtype=object)

In [7]:
df.keys

<bound method NDFrame.keys of    Age    Name
0   42    Inam
1   26  Mohsin>

In [8]:
df

   Age    Name
0   42    Inam
1   26  Mohsin

In [9]:
df.columns

Index(['Age', 'Name'], dtype='object')

In [10]:
df.Age

0    42
1    26
Name: Age, dtype: int64

In [11]:
df['Age']

0    42
1    26
Name: Age, dtype: int64

In [12]:
student2 = {"Name": ["Inam","Mohsin"], "Age":[42,26]}
df2 = pd.DataFrame(student2)

In [13]:
df2

     Name  Age
0    Inam   42
1  Mohsin   26

In [14]:
# to add a new colume with some value
df['GPA']=3.5

In [15]:
df

   Age    Name  GPA
0   42    Inam  3.5
1   26  Mohsin  3.5

In [16]:
df2 = pd.DataFrame(student2,index=range(1,3))

In [17]:
df2

     Name  Age
1    Inam   42
2  Mohsin   26

In [18]:
df2.T

         1       2
Name  Inam  Mohsin
Age     42      26

In [19]:
df2

     Name  Age
1    Inam   42
2  Mohsin   26

In [20]:
khi_temps = [{"Temp" : 45 ,"Date" : "1/1/21"},{"Temp" : 40 ,"Date" : "2/1/21"},{"Temp" : 42 ,"Date" : "3/1/21"},{"Temp" : 39 ,"Date" : "4/1/21"}]

In [21]:
df3 = pd.DataFrame(khi_temps)

In [22]:
df3

     Date  Temp
0  1/1/21    45
1  2/1/21    40
2  3/1/21    42
3  4/1/21    39

In [23]:
df3.index.name = "Time of Temp"
df3.columns.name = "Head"

In [24]:
df3

Head            Date  Temp
Time of Temp
0             1/1/21    45
1             2/1/21    40
2             3/1/21    42
3             4/1/21    39

In [25]:
df3.reindex([0,2,6])

Head            Date  Temp
Time of Temp
0             1/1/21  45.0
2             3/1/21  42.0
6                NaN   NaN

In [26]:
df3.reindex([0,2,7],method="ffill")# last index 3 was 39 it fille 39 to index 7

Head            Date  Temp
Time of Temp
0             1/1/21    45
2             3/1/21    42
7             4/1/21    39

In [27]:
df3

Head            Date  Temp
Time of Temp
0             1/1/21    45
1             2/1/21    40
2             3/1/21    42
3             4/1/21    39

In [30]:
del df["GPA"]

In [31]:
df

   Age    Name
0   42    Inam
1   26  Mohsin